Repository: AhmedAlSaey/Shoryan-iOS
Catalog: Shoryan/Resouces/*.lproj/Localizable.strings
Languages: ar

# logo-picture
source: logo-picture_en
ar: logo-picture_ar

# back-button
source: back-button_ltr
ar: back-button_rtl

# logo-shadowed
source: logo-shadowed_en
ar: logo-shadowed_ar

# back-arrow-white
source: back-arrow-white_ltr
ar: back-arrow-white_rtl

source: Continue
ar: استمرار

source: Ok
ar: حسنا

source: Cancel
ar: إلغاء

source: Loading
ar: جار التحميل

source: Error
ar: خطأ

source: Success
ar: نجاح

source: Male
ar: ذكر

source: Female
ar: أنثى

source: Urgent
ar: ضروري

source: Done
ar: تم

source: Points
ar: نقطة

source: Close
ar: إغلاق

# incorrectphonenumber.alert
source: Please make sure you entered a correct phone number
ar: الرجاء التأكد من صحة رقم الهاتف

# incorrectpassword.alert
source: Please make sure you entered a correct password
ar: الرجاء التأكد من صحة كلمة كلمة المرور

# incorrectcode.alert
source: Please make sure you entered a valid code
ar: الرجاء التأكد من ادخال رمز صحيح

# coderesent.alert
source: Code resent successfully
ar: تم إعادة إرسال الرمز بنجاح

# incorrectinput.alert
source: Please make sure you entered all the required field and make sure they are correct
ar: الرجاء التأكد من ادخال جميع المعلومات و التأكد من صحتها

# notregistereddonor.alert
source: You are not registered as a donor for a request
ar: أنت غير مسجل كمتبرع لطلب

# donorregistered.alert
source: Your are now registered as a donor
ar: أنت الآن مسجل كمتبرع

# unpermitteddonation.alert
source: You can't donate to this request
ar: لا يسمح لك بالتبرع لهذا الطلب

# donationsuccess.alert
source: You have successfully donated to this request!
ar: لقد تبرعت لهذا الطلب!

# canceldonationsuccess.alert
source: You are now not registered as a donor
ar: أنت الآن غير مسجل كمتبرع

# incompatiblebloodtype.alert
source: You can't donate to this request, your blood type is incompatible
ar: لا يمكنك التبرع لهذا الطلب ، فصيلة دمك غير متوافقة

# agecheckfail.alert
source: You have to be 18 years old or older to donate blood
ar: يجب أن يكون عمرك ۱۸ عامًا أو أكثر للتبرع بالدم

# breaktimecheckfail.alert
source: You can't donate more than once every 3 months
ar: لا يمكنك التبرع أكثر من مرة كل ۳ أشهر

# usergoingtoanotherrequest.alert
source: You already have another pending request
ar: أنت مسجل كمتبرع لطلب آخر

# alreadygoingtorequest.alert
source: You are already regestered as a donor for this request
ar: أنت بالفعل مسجل كمتبرع لهذا الطلب

# cantdonatetorequest.alert
source: You can't donate to this request
ar: لا يمكنك التبرع لهذا الطلب

# selectbranch.alert
source: Please select a branch
ar: الرجاء تحديد الفرع

# home.tabbaritem
source: Home
ar: الصفحة الرئيسية

# newrequest.tabbaritem
source: New Request
ar: طلب جديد

# notifications.tabbaritem
source: Notifications
ar: الإشعارات

# profile.tabbaritem
source: Profile
ar: حسابى

# login.button
source: Login
ar: تسجيل دخول

# register.button
source: Register
ar: إنشاء حساب جديد

# login.label
source: Login
ar: تسجيل دخول

# mobilenumber.label
source: Mobile number
ar: رقم الهاتف

# loginpassword.button
source: Login with password
ar: الدخول بكلمة السر

# loginsms.button
source: Login with SMS
ar: الدخول برسالة نصية

# codeauthintication.label
source: Verification Code
ar: رمز الدخول

# codeaurthenticationinstruction
source: Enter the verification code we sent to
ar: قم بإدخال رمز الدخول المرسل إلى

# codesubmit.button
source: Submit
ar: تأكيد

# resendcode.button
source: Resend Code
ar: إعادة إرسال الرمز

# loginpasswordinstructions.label
source: Enter the password for mobile number
ar: قم بإدخال كلمة السر الخاصة برقم

# password.label
source: Password
ar: كلمة السر

# password.placeholder
source: Password
ar: كلمة السر

# register.label
source: Register
ar: إنشاء حساب جديد

# firstname.placeholder
source: First Name
ar: الاسم الأول

# lastname.placeholder
source: Last Name
ar: الاسم الأخير

# mobilephone.placeholder
source: Mobile Number
ar: رقم الهاتف

# birthdate.label
source: Date of Birth
ar: تاريخ الميلاد

# birthdate.placeholder
source: DD/MM/YYYY
ar: يوم/شهر/سنة

# bloodtype.label
source: Blood Type
ar: فصيلة الدم

# bloodtype.placeholder
source: Blood Type
ar: فصيلة الدم

# gender.label
source: Gender
ar: النوع

# gender.placeholder
source: Gender
ar: النوع

# address.placeholder
source: Address
ar: العنوان

# changelocation.button
source: Change Location
ar: تغيير الموقع

# confirmpassword.placeholder
source: Confirm Password
ar: تأكيد كلمة السر

# name.unvalidatedplaceholder
source: Please enter an english or arabic name
ar: الرجاء ادخال اسم عربي او انجليزي

# phone.unvalidatedplaceholder
source: Please enter an egyptian number
ar: الرجاء ادخال رقم مصري

# birthdate.unvalidatedplaceholder
source: Please enter a birth date
ar: الرجاء ادخال تاريخ ميلاد

# bloodtype.unvalidatedplaceholder
source: Please make a selection
ar: الرجاء الاختيار

# gender.unvalidatedplaceholder
source: Please make a selection
ar: الرجاء الاختيار

# location.unvalidatedplaceholder
source: Please select your current location
ar: الرجاء اختيار الموقع الحالي

# password.unvalidatedplaceholder
source: Make sure the password contains [A-Z]، [a-z]، [0-9]
ar: الرجاء اختيار كلمة سر تحتوي علي [A-Z]، [a-z]، [0-9]

# confirmpassword.unvalidatedplaceholder
source: Please enter a correct password confirmation
ar: الرجاء التأكد من صحة تأكيد كلمة المرور

# homenavigationtitle.label
source: Home
ar: الصفحة الرئيسية

# myrequests.label
source: My Donations
ar: طلباتى

# pendingrequest.label
source: Pending
ar: في انتظارك

# rewards.label
source: Rewards
ar: مكافآت

# requests.label
source: Requests
ar: الطلبات

# filer.button
source: Sort by
ar: تصنيف حسب

# donationrequestnavtitle.label
source: Donation Request
ar: طلب تبرع بالدم

# bloodbags.label
source: Blood Bags
ar: أكياس الدم

# activedonors.label
source: People are on their way to donate
ar: أشخاص في طريقهم للتبرع لهذا الطلب

# registerdonoralert.label
source: You are now registered as a donor for this request, we are awaiting your arrival to the blood bank
ar: انت الان مسجل كمتبرع لهذا الطلب, نحن في انتظار وصولك الي بنك الدم

# donate.button
source: Donate
ar: تبرع

# canceldonation.button
source: Cancel Donation
ar: إلغاء التبرع

# idonated.button
source: I Donated
ar: لقد تبرعت

# cancelrequest.button
source: Cancel Request
ar: إلغاء الطلب

# filternavtitle.label
source: Sort by
ar: تصنيف حسب

# reset.button
source: Reset
ar: مسح

# allowedbloodtyped.button
source: Blood typed I can donate to
ar: الفصائل التي يمكننى التبرع لها

# rewardsnavtitle.label
source: Rewards
ar: مكافآت

# rewardnavtitle.label
source: Rewards
ar: مكافأة

# branches.label
source: Branches
ar: الفروع

# redeem.button
source: Redeem
ar: استرد العرض

# rewardcodeinstruction.label
source: Enter the code we sent to the branch clerk
ar: ادخل الكود المرسل لموظف الفرع

# successtitle.label
source: Success!
ar: عملية ناجحة!

# successdescription.label
source: Offer Redeemed
ar: تم استرداد العرض

# successnavbartitle.label
source: Reward
ar: مكافأة
